In [1]:
import pandas as pd

In [2]:
emp = pd.read_csv("employees.csv")

In [8]:
emp.head(2)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600.0,NaN,124.0,50.0
1,199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600.0,NaN,124.0,50.0

In [10]:
emp.tail(1)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
49,140,Joshua,Patel,JPATEL,650.121.1834,6-Apr-06,ST_CLERK,2500.0,NaN,123.0,50.0

In [11]:
emp.index

RangeIndex(start=0, stop=50, step=1)

In [13]:
#emp.values

In [15]:
emp.shape

(50, 11)

In [17]:
emp.dtypes

EMPLOYEE_ID         int64
FIRST_NAME         object
LAST_NAME          object
EMAIL              object
PHONE_NUMBER       object
HIRE_DATE          object
JOB_ID             object
SALARY            float64
COMMISSION_PCT    float64
MANAGER_ID        float64
DEPARTMENT_ID     float64
dtype: object

In [19]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     50 non-null     int64
 1   FIRST_NAME      50 non-null     object
 2   LAST_NAME       50 non-null     object
 3   EMAIL           49 non-null     object
 4   PHONE_NUMBER    48 non-null     object
 5   HIRE_DATE       49 non-null     object
 6   JOB_ID          49 non-null     object
 7   SALARY          46 non-null     float64
 8   COMMISSION_PCT  0 non-null      float64
 9   MANAGER_ID      47 non-null     float64
 10  DEPARTMENT_ID   48 non-null     float64
dtypes: float64(4), int64(1), object(6)
memory usage: 4.4+ KB

In [41]:
emp = pd.read_csv("employees.csv", index_col = "EMPLOYEE_ID")

In [42]:
emp.head(2)

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600.0,NaN,124.0,50.0
199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600.0,NaN,124.0,50.0

In [39]:
gog = pd.read_csv("Google_Stock_Price_Test.csv", index_col = "Date")

In [17]:
gog.sum(axis = 0)
gog.sum(axis = "index")

Open                                               16150.52
High                                               16238.53
Low                                                16038.99
Close                                              16158.09
Volume    1,657,3001,073,0001,335,2001,640,2001,272,4001...
dtype: object

In [14]:
gog.sum(axis = "columns")
gog.sum(axis = 1).head()

C:\Users\Admin\AppData\Local\Temp\ipykernel_18360\2264438200.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  gog.sum(axis = "columns")
C:\Users\Admin\AppData\Local\Temp\ipykernel_18360\2264438200.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  gog.sum(axis = 1).head()

Date
1/3/2017    3130.38
1/4/2017    3149.76
1/5/2017    3159.60
1/6/2017    3201.51
1/9/2017    3225.85
dtype: float64

In [20]:
emp.head(2)

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600.0,NaN,124.0,50.0
199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600.0,NaN,124.0,50.0

In [23]:
emp.FIRST_NAME
type(emp.FIRST_NAME)

pandas.core.series.Series

In [28]:
emp["EMAIL"]
emp["SALARY"].head(2)

EMPLOYEE_ID
198    2600.0
199    2600.0
Name: SALARY, dtype: float64

In [30]:
emp[["FIRST_NAME", "LAST_NAME"]].head(2)

            FIRST_NAME LAST_NAME
EMPLOYEE_ID
198             Donald  OConnell
199            Douglas     Grant

In [32]:
emp["DEPT"] = "RESEARCH"

In [34]:
emp.head(2)

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,DEPT
EMPLOYEE_ID,,,,,,,,,,,
198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600.0,NaN,124.0,50.0,RESEARCH
199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600.0,NaN,124.0,50.0,RESEARCH

In [37]:
emp.insert(loc = 3, column = "DEPT", value = "RESEARCH")

In [38]:
emp.head(2)

,FIRST_NAME,LAST_NAME,EMAIL,DEPT,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,,
198,Donald,OConnell,DOCONNEL,RESEARCH,650.507.9833,21-Jun-07,SH_CLERK,2600.0,NaN,124.0,50.0
199,Douglas,Grant,DGRANT,RESEARCH,650.507.9844,13-Jan-08,SH_CLERK,2600.0,NaN,124.0,50.0

In [46]:
emp["SALARY"].head(3) * 1.1

EMPLOYEE_ID
198    2860.0
199    2860.0
200    4840.0
Name: SALARY, dtype: float64

In [48]:
emp["MANAGER_ID"].value_counts().head(3)

100.0    8
108.0    5
114.0    5
Name: MANAGER_ID, dtype: int64

In [50]:
emp.head()

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600.0,NaN,124.0,50.0
199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600.0,NaN,124.0,50.0
200,Jennifer,Whalen,JWHALEN,515.123.4444,17-Sep-03,AD_ASST,4400.0,NaN,101.0,10.0
201,Michael,Hartstein,MHARTSTE,515.123.5555,17-Feb-04,MK_MAN,13000.0,NaN,100.0,20.0
202,Pat,Fay,PFAY,603.123.6666,17-Aug-05,MK_REP,6000.0,NaN,201.0,20.0

In [51]:
#Remove all the rows which contains at least one NaN 
#emp.dropna()

In [53]:
emp.dropna(how = "all").head(2)

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600.0,NaN,124.0,50.0
199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600.0,NaN,124.0,50.0

In [55]:
emp.dropna(subset = ["EMAIL"]).head(2)

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600.0,NaN,124.0,50.0
199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600.0,NaN,124.0,50.0

In [62]:
emp = pd.read_csv("employees.csv", index_col = "EMPLOYEE_ID").dropna(how = "all")

In [63]:
emp.head(2)

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600.0,NaN,124.0,50.0
199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600.0,NaN,124.0,50.0

In [64]:
emp["JOB_ID"].fillna("Unknown").head(2)

EMPLOYEE_ID
198    SH_CLERK
199    SH_CLERK
Name: JOB_ID, dtype: object

In [68]:
emp["SALARY"].hasnans

True

In [75]:
emp["SALARY"] = emp["SALARY"].fillna(0.0)

In [76]:
emp["SALARY"].hasnans

False

In [79]:
emp["SALARY"].astype("int").head(3)

EMPLOYEE_ID
198    2600
199    2600
200    4400
Name: SALARY, dtype: int32

In [84]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50 entries, 198 to 140
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   FIRST_NAME      50 non-null     object
 1   LAST_NAME       50 non-null     object
 2   EMAIL           49 non-null     object
 3   PHONE_NUMBER    48 non-null     object
 4   HIRE_DATE       49 non-null     object
 5   JOB_ID          49 non-null     object
 6   SALARY          50 non-null     float64
 7   COMMISSION_PCT  0 non-null      float64
 8   MANAGER_ID      47 non-null     float64
 9   DEPARTMENT_ID   48 non-null     float64
dtypes: float64(4), object(6)
memory usage: 4.3+ KB

In [85]:
emp["JOB_ID"] = emp["JOB_ID"].astype("category")

In [92]:
emp.sort_values(by = "HIRE_DATE", ascending = False, na_position = "first").head(3)

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
118,Guy,Himuro,NaN,NaN,NaN,PU_CLERK,2600.0,NaN,114.0,30.0
128,Steven,Markle,SMARKLE,650.124.1434,8-Mar-08,ST_CLERK,2200.0,NaN,120.0,50.0
112,Jose Manuel,Urman,JMURMAN,515.124.4469,7-Mar-06,FI_ACCOUNT,7800.0,NaN,108.0,100.0

In [99]:
emp.sort_values(by = ["JOB_ID", "FIRST_NAME"], ascending = False).head(3)

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
123,Shanta,Vollman,SVOLLMAN,650.123.4234,10-Oct-05,ST_MAN,6500.0,NaN,100.0,50.0
122,Payam,Kaufling,PKAUFLIN,650.123.3234,1-May-03,ST_MAN,7900.0,NaN,100.0,50.0
120,Matthew,Weiss,MWEISS,650.123.1234,18-Jul-04,ST_MAN,8000.0,NaN,100.0,50.0

In [100]:
emp.sort_values(by = ["JOB_ID", "FIRST_NAME"], ascending = [False, True]).head(3)

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
121,Adam,Fripp,AFRIPP,650.123.2234,10-Apr-05,ST_MAN,8200.0,NaN,100.0,50.0
124,Kevin,Mourgos,KMOURGOS,650.123.5234,16-Nov-07,ST_MAN,5800.0,NaN,100.0,50.0
120,Matthew,Weiss,MWEISS,650.123.1234,18-Jul-04,ST_MAN,8000.0,NaN,100.0,50.0

In [105]:
emp.sort_index(ascending = True).head(3)

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
EMPLOYEE_ID,,,,,,,,,,
100,Steven,King,SKING,515.123.4567,17-Jun-03,AD_PRES,24000.0,NaN,NaN,90.0
101,Neena,Kochhar,NKOCHHAR,515.123.4568,21-Sep-05,AD_VP,17000.0,NaN,100.0,90.0
102,Lex,De Haan,LDEHAAN,515.123.4569,13-Jan-01,AD_VP,17000.0,NaN,100.0,90.0

In [109]:
emp["SALARY"] = emp["SALARY"].fillna(0.0).astype(int)

In [114]:
emp["SALARY_RANK"] = emp["SALARY"].rank(ascending = False).astype(int)

In [118]:
emp.sort_values(by = "SALARY", ascending = False).head()

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,SALARY_RANK
EMPLOYEE_ID,,,,,,,,,,,
100,Steven,King,SKING,515.123.4567,17-Jun-03,AD_PRES,24000,NaN,NaN,90.0,1
102,Lex,De Haan,LDEHAAN,515.123.4569,13-Jan-01,AD_VP,17000,NaN,100.0,90.0,2
101,Neena,Kochhar,NKOCHHAR,515.123.4568,21-Sep-05,AD_VP,17000,NaN,100.0,90.0,2
201,Michael,Hartstein,MHARTSTE,515.123.5555,17-Feb-04,MK_MAN,13000,NaN,100.0,20.0,4
205,Shelley,Higgins,SHIGGINS,515.123.8080,7-Jun-02,AC_MGR,12008,NaN,101.0,110.0,5